package num2words

import (
	"testing"
)

func TestConvert(t *testing.T) {
	cases := map[int]string{
		-5:           "минус пять",
		1:            "один",
		12:           "двенадцать",
		21:           "двадцать один",
		121:          "сто двадцать один",
		320:          "триста двадцать",
		359:          "триста пятьдесят девять",
		1002:         "одна тысяча два",
		5358:         "пять тысячь триста пятьдесят восемь",
		1588650:      "один миллион пятьсот восемьдесят восемь тысячь шестьсот пятьдесят",
		3000000:      "три миллиона",
		355000120:    "триста пятьдесят пять миллионов сто двадцать",
		1055000000:   "один миллиард пятьдесят пять миллионов",
		555055055015: "пятьсот пятьдесят пять миллиардов пятьдесят пять миллионов пятьдесят пять тысячь пятнадцать",
	}

	for k, v := range cases {
		res := Convert(k)
		// fmt.Println(fmt.Sprintf("%s = %s, %v", v, res, res == v))
		if res != v {
			t.Fail()
		}
	}

}

func TestNumbericDeclension(t *testing.T) {
	cases := map[int]string{
		1:  "чашка",
		2:  "чашки",
		8:  "чашек",
		10: "чашек",
		11: "чашек",
		12: "чашек",
		21: "чашка",
		28: "чашек",
	}
	for k, v := range cases {
		res := NumbericDeclensio(k, []string{"чашка", "чашки", "чашек"})
		if v != res {
			t.Fail()
		}
		// fmt.Println(fmt.Sprintf("%s == %s, %v", v, res, v == res))
	}
}
